"""
1. Необходимо написать максимальное количество тестовых проверок для функций
add, minus, multiply.

Например для функции add:
    1. Складываем два числа ``add(1, 3)``
    2. Складываем две строки ``add('1', '3')``
    3. Складываем строку и число ``add(1, '3')``

2. Необходимо сделать так, чтобы тесты можно было запустить. Для
этого возможно потребуется периеменовать файл.

3. Выбрать команду для запуска тестов
"""


def add(a: int, b: int):
    return a + b


def minus(a: int, b: int):
    return a - b


def multiply(a: int, b: int):
    return a * b


def test_1():
    ...


def test_2():
    ...


def test_3():
    ...


def test_4():
    ...
