"""
Для тестов из предыдущего домашнего задания урока 14 расставить 
allure информацию:

- Шаги - allure.step
- Приоритет - allure.severity
- Заголовки тестов - allure.title 
- Фичи - allure.feature, добавить какую-либо фичу к тестам
- Стори - allure.story, сгруппировать тесты по сторям, например создание, удаление, получение
- Краткое описание - allure.description, краткое описание того, что делает тест
- Эпик - allure.epic
- Файлы - allure.attach.file
- Баги - allure.issue, прикрепить несколько ссылок, на баги

И сгенерировать отчет, отчет перенести в zip
"""